[
  {
    "id": "34597",
    "slug": "friday-night-funkin-unblocked",
    "title": "Friday Night Funkin Unblocked",
    "url": "https://html5.gamemonetize.com/8g62o78s1wjhsiu54xlmql32h7pagsek/",
    "thumbnail": "https://img.gamemonetize.com/8g62o78s1wjhsiu54xlmql32h7pagsek/512x384.jpg",
    "genre": [
      "Hypercasual"
    ],
    "height": 1280,
    "width": 720,
    "description": "Friday Night Funkin Unblocked is a wildly popular casual arcade music game where you can immerse yourself in the crazy beats and supercharged duels. Tap the arrows in sync with the beats to nail every note and stay on rhythm! Face off against all kinds of funky foes. The pace is getting faster and the challenges more exciting! Super original beats and music tracks, let you get addicted to FNFs unique sound tour world!",
    "tags": [
      "Funny",
      "Music",
      "Rhythm"
    ]
  },
  {
    "id": "34596",
    "slug": "stickman-slash",
    "title": "Stickman Slash",
    "url": "https://html5.gamemonetize.com/dimgvlqk0miw677p6zv1snl4u3491l3i/",
    "thumbnail": "https://img.gamemonetize.com/dimgvlqk0miw677p6zv1snl4u3491l3i/512x384.jpg",
    "genre": [
      "Fighting"
    ],
    "height": 800,
    "width": 480,
    "description": "Experience the world of one of your favorite fighting action games but with stickman as main hero! Advanced physics and immersive graphics have brought this experience to a whole new level for players!",
    "tags": [
      "Arcade",
      "Blood",
      "Fight",
      "free html5 games for your website",
      "Killing",
      "kiz10",
      "Levels",
      "sliding",
      "Stickman"
    ]
  },
  {
    "id": "34595",
    "slug": "flowers-vs-zombies",
    "title": "Flowers vs Zombies",
    "url": "https://html5.gamemonetize.com/xn12cq3wtha3qeb9es5281yv7xhbtkvv/",
    "thumbnail": "https://img.gamemonetize.com/xn12cq3wtha3qeb9es5281yv7xhbtkvv/512x384.jpg",
    "genre": [
      "Shooting"
    ],
    "height": 1280,
    "width": 720,
    "description": "&amp;zwnj;Flowers vs Zombies&amp;zwnj; is a strategic plant-placement game where players defend against zombie attacks by placing flowers that automatically shoot bullets. Two flowers can be merged into a more advanced one, with higher-tier flowers having greater attack power. Killing zombies earns points, and the higher the score, the better the ranking.",
    "tags": [
      "2D",
      "garden",
      "Zombie"
    ]
  },
  {
    "id": "34594",
    "slug": "macho-man-go",
    "title": "Macho Man Go",
    "url": "https://html5.gamemonetize.com/x1gpfvr0wehy1sptr6289mh0wt1ijc88/",
    "thumbnail": "https://img.gamemonetize.com/x1gpfvr0wehy1sptr6289mh0wt1ijc88/512x384.jpg",
    "genre": [
      "Arcade"
    ],
    "height": 720,
    "width": 1280,
    "description": "Ready to run, jump, punch, and dominate in Macho Man Go. As a muscle-bound hero, race through action platform levels filled with traps, enemies, and high-octane challenges! This game blends racing, fighting and running gameplay. Dash through obstacle courses and avoid deadly traps. Collect gems and power-ups, and unlock epic new skins and abilities! Collect various body parts to increase your strength. Avoid various obstacles like walls, spikes, etc.",
    "tags": [
      "Battle",
      "Jumping",
      "Racing",
      "running"
    ]
  },
  {
    "id": "34593",
    "slug": "vemon-run-3d",
    "title": "Vemon Run 3D",
    "url": "https://html5.gamemonetize.com/r3jhlbh7d5cuihn60hzv7dqw08x7f3kl/",
    "thumbnail": "https://img.gamemonetize.com/r3jhlbh7d5cuihn60hzv7dqw08x7f3kl/512x384.jpg",
    "genre": [
      "Hypercasual"
    ],
    "height": 750,
    "width": 1334,
    "description": "Vemon Run 3D brings a fun arcade running game. Step into a vivid 3D platform world. You become the nimble Vemon, racing forward and avoiding obstacles in a thrilling running adventure. Flexibly move your character to dodge left and right, and sprint at breakneck speeds! Keep collecting more gems to upgrade your character. Pass through positive-numbered doors. Destroy enemies to gain upgrades and transform into a superhero!",
    "tags": [
      "3D",
      "Fun",
      "Racing",
      "running"
    ]
  },
  {
    "id": "34591",
    "slug": "tricky-planner",
    "title": "Tricky Planner",
    "url": "https://html5.gamemonetize.com/i4zl0gf27v3w7fp25cposy3e50qg6oou/",
    "thumbnail": "https://img.gamemonetize.com/i4zl0gf27v3w7fp25cposy3e50qg6oou/512x384.jpg",
    "genre": [
      "Puzzles"
    ],
    "height": 1080,
    "width": 1920,
    "description": "Tricky Planner is a challenging arcade puzzle game that tests your logic, timing, and strategy skills. Guide colorful fish through tricky underwater mazes, avoid hungry sharks, and collect all targets before time runs out. Featuring vibrant graphics, addictive gameplay, and brain-teasing levels, this free online puzzle challenge is perfect for fans of strategic thinking games, underwater adventures, and skill-based arcade fun. Play now and prove you&amp;rsquo;re the ultimate tricky planner!",
    "tags": [
      "Arcade",
      "Best",
      "Best Games",
      "Casual",
      "HTML5",
      "NapTech Games",
      "Online",
      "Puzzle",
      "Skill"
    ]
  },
  {
    "id": "34589",
    "slug": "tung-tung-sahur-snow-arena",
    "title": "Tung Tung Sahur Snow Arena",
    "url": "https://html5.gamemonetize.com/kg8cugwnyq2diywtw761mv7jjdu6q6ty/",
    "thumbnail": "https://img.gamemonetize.com/kg8cugwnyq2diywtw761mv7jjdu6q6ty/512x384.jpg",
    "genre": [
      "Arcade"
    ],
    "height": 600,
    "width": 800,
    "description": "Powerful snowballs are being fired at you from two towers on the left and right &amp;mdash; be careful! By the way, you can push your friend and knock them into the icy water. The player who falls the most loses the game. To win this cold battle with your friend, you must manage to stay on the ice. The first player to fall into the water 10 times loses. Be very careful &amp;mdash; staying on the ice is extremely difficult!",
    "tags": [
      "2 Player",
      "2 Player Games",
      "2D",
      "Arena",
      "Battle",
      "Brainrot Italian",
      "Tralalero Tralala",
      "Tung Tung",
      "Tung Tung Tung Sahur"
    ]
  },
  {
    "id": "34588",
    "slug": "dead-zone15165",
    "title": "Dead Zone15165",
    "url": "https://html5.gamemonetize.com/awku83ardtmr5fs8p5miwb29n518zh4k/",
    "thumbnail": "https://img.gamemonetize.com/awku83ardtmr5fs8p5miwb29n518zh4k/512x384.jpg",
    "genre": [
      "Shooting"
    ],
    "height": 600,
    "width": 800,
    "description": "Dead Zone is a lightweight 2D zombie shooter designed for instant browser play. Players control a lone survivor in a cartoon-style world, dodging and shooting waves of undead with simple one-button mechanics. Built for fast reflexes and short sessions, Dead Zone runs smoothly even on low-end devices .",
    "tags": [
      "1 Player",
      "3D",
      "survival",
      "Zombie"
    ]
  },
  {
    "id": "34587",
    "slug": "zombie-survival-2",
    "title": "Zombie Survival 2",
    "url": "https://html5.gamemonetize.com/83siph0wqz04p8mp137w5uch7vk5t0nu/",
    "thumbnail": "https://img.gamemonetize.com/83siph0wqz04p8mp137w5uch7vk5t0nu/512x384.jpg",
    "genre": [
      "Arcade"
    ],
    "height": 720,
    "width": 1280,
    "description": "Play the nervous zombie adventure in Zombie Survival. Explore a dangerous world occupied by zombies. Collect various weapons to attack zombies. Move smartly and set traps to defend yourself from massive zombie waves. Explore abandoned cities, dark alleys, and creepy forests - each level is a new adventure! Challenge big zombie bosses and prove your survival skills under pressure! Collect many useful items to fix your broken tools.",
    "tags": [
      "attack",
      "Shoot",
      "survival",
      "Zombie"
    ]
  },
  {
    "id": "34586",
    "slug": "minecraft-battle-party",
    "title": "Minecraft Battle Party",
    "url": "https://html5.gamemonetize.com/3sqyn27o6l24az2w2tmlxc8amc3mt5a4/",
    "thumbnail": "https://img.gamemonetize.com/3sqyn27o6l24az2w2tmlxc8amc3mt5a4/512x384.jpg",
    "genre": [
      "Arcade"
    ],
    "height": 750,
    "width": 1334,
    "description": "Ready for a hot feast of square battles? In Minecraft Battle Party, youll enter a pixel-styled battle arena where nervous fighting meets iconic Minecraft-style visuals. In this world, every game is a duel to the death. You will play different roles and use different weapons. For example, as a gunner, constantly move your character so that enemies are shot within your scanning range. Watch out for other peoples attacks.",
    "tags": [
      "Battle",
      "Fight",
      "Funny",
      "Minecraft"
    ]
  },
  {
    "id": "34585",
    "slug": "princess-run-3d",
    "title": "Princess Run 3D",
    "url": "https://html5.gamemonetize.com/gwe3ok9bdz6cx8n0t26rs26qr6rxb0kx/",
    "thumbnail": "https://img.gamemonetize.com/gwe3ok9bdz6cx8n0t26rs26qr6rxb0kx/512x384.jpg",
    "genre": [
      "Arcade"
    ],
    "height": 720,
    "width": 1280,
    "description": "Want a magical and exciting running adventure? Step into Princess Run 3D, a fun 3D platform arcade game full of exciting challenges. Play as a fearless princess racing through colorful 3D worlds. Collect beautiful clothes, shoes, hair, etc. Increase your charisma to get a maid of honor. Theyre going to help you fend off enemies in front of you or dirty mud, rain, etc. Be careful to avoid ugly clothes, costumes, bad weather, etc",
    "tags": [
      "3D Games",
      "Princess",
      "running"
    ]
  },
  {
    "id": "34584",
    "slug": "alex-whiskers",
    "title": "Alex Whiskers",
    "url": "https://html5.gamemonetize.com/m97tod5mmb9hq2m1jhdbjlxvjwisbtqe/",
    "thumbnail": "https://img.gamemonetize.com/m97tod5mmb9hq2m1jhdbjlxvjwisbtqe/512x384.jpg",
    "genre": [
      "Adventure"
    ],
    "height": 720,
    "width": 1280,
    "description": "Join Alex Whiskers, the adventurous town cat, on a fast-paced hunt for tasty fish! Dash through busy streets, bounce high on springs, dodge speeding cars, and stay clear of the big bad bulldogs who&amp;rsquo;d love to stop you in your tracks. Quick paws and sharp reflexes are your best friends in this fun, action-packed 3D adventure.",
    "tags": [
      "1 Player",
      "3D",
      "Cat",
      "Funny",
      "Jumping",
      "Platform"
    ]
  },
  {
    "id": "34583",
    "slug": "safari-match",
    "title": "Safari Match",
    "url": "https://html5.gamemonetize.com/047gqvec2g1nektwuly9xns02mefpknw/",
    "thumbnail": "https://img.gamemonetize.com/047gqvec2g1nektwuly9xns02mefpknw/512x384.jpg",
    "genre": [
      "Puzzles"
    ],
    "height": 2560,
    "width": 1280,
    "description": "Play Safari Match, a fun and addictive match-3 puzzle game set in the heart of the wild safari! Match colorful animal blocks, solve exciting puzzles, and unlock powerful boosters to win. Easy to play yet challenging to master, with hundreds of fun levels and stunning graphics. Perfect for kids and adults who love brain games, block puzzles, and animal-themed adventures. Play anywhere&amp;mdash;mobile, tablet, or desktop&amp;mdash;and become the ultimate match-3 champion!",
    "tags": [
      "Arcade",
      "Match 3",
      "Matching",
      "NapTech Games",
      "Puzzle",
      "puzzleblock"
    ]
  },
  {
    "id": "34582",
    "slug": "burst-it-right",
    "title": "Burst It Right",
    "url": "https://html5.gamemonetize.com/r05pfchgkm1mj37vg3bpmm9yw0dj51s3/",
    "thumbnail": "https://img.gamemonetize.com/r05pfchgkm1mj37vg3bpmm9yw0dj51s3/512x384.jpg",
    "genre": [
      "Hypercasual"
    ],
    "height": 600,
    "width": 800,
    "description": "Get ready for a colorful popping challenge in Burst It Right! Your task is to guide drifting balloons into position and pop them using matching-colored pins. Accuracy is key &amp;mdash; only a correct color match will burst the balloon, while mismatches count as failures. With limited chances and increasing speed, your timing and strategy will be put to the test. Can you keep up the popping streak and master the art of precision bursting?",
    "tags": [
      "Ballon",
      "Best",
      "Casual",
      "Color"
    ]
  },
  {
    "id": "34581",
    "slug": "smash-sprout",
    "title": "Smash Sprout",
    "url": "https://html5.gamemonetize.com/yil0x9n0lz9w2q7wihlt53hidzdtj5co/",
    "thumbnail": "https://img.gamemonetize.com/yil0x9n0lz9w2q7wihlt53hidzdtj5co/512x384.jpg",
    "genre": [
      "Hypercasual"
    ],
    "height": 600,
    "width": 800,
    "description": "Get your hammer ready and dive into the whacky world of Smash Sprout! Moles are popping up left and right, and it&amp;rsquo;s your job to thump them back into their holes with perfect timing. Each well-aimed hit boosts your score, but miss too many, and it&amp;rsquo;s game over! With fast-paced action, limited chances, and an ever-growing mole invasion, only the quickest reflexes will rise to the top. Can you smash your way to victory?",
    "tags": [
      "Best",
      "Casual"
    ]
  },
  {
    "id": "34580",
    "slug": "scary-maze-7",
    "title": "Scary Maze 7",
    "url": "https://html5.gamemonetize.com/aw9men7759mj6eepont3zmzglp1g755o/",
    "thumbnail": "https://img.gamemonetize.com/aw9men7759mj6eepont3zmzglp1g755o/512x384.jpg",
    "genre": [
      "Puzzles"
    ],
    "height": 480,
    "width": 854,
    "description": "Do you enjoy the rush of a good scare? Online games that test your courage have a special pull. The scary maze genre stands out, pushing players to their limits. Scary Maze 7 is the newest version of this well-known and often dreaded experience. It offers a fresh take on the classic internet maze game.",
    "tags": [
      "1 Player",
      "Maze"
    ]
  },
  {
    "id": "34578",
    "slug": "jungle-fury-mutant-rhino-mayhem",
    "title": "Jungle Fury Mutant Rhino Mayhem",
    "url": "https://html5.gamemonetize.com/6xmc3rr9d1g36oxh8zgmuwmmpp2qrt4f/",
    "thumbnail": "https://img.gamemonetize.com/6xmc3rr9d1g36oxh8zgmuwmmpp2qrt4f/512x384.jpg",
    "genre": [
      "Adventure"
    ],
    "height": 1080,
    "width": 1920,
    "description": "Enter a jungle plagued by mutant rhino warriors! As a brave tribal hero, rescue captured villagers, battle fierce enemies, and defeat powerful rhino bosses. Use bows, axes, and legendary weapons from the Blacksmith Shop to fight through deadly swamps, chaotic caverns, and fortified ramparts. Can you stop the Apex Mutant Rhino Warlord and restore peace to the land? Key Features: 20 intense levels with thrilling boss fights Unique enemies, from Rhino Brutes to Vampire Bats Powerful weapons like the Thunder Hammer &amp;amp; Lightning Sword Blacksmith Shop for upgrades and new gear Health herbs &amp;amp; gold mushrooms to aid your quest Epic medieval setting",
    "tags": [
      "1 Player",
      "Action",
      "Adventure",
      "Monster",
      "Platform",
      "Superhero"
    ]
  },
  {
    "id": "34577",
    "slug": "bubble-shoot-merge-box-2048",
    "title": "Bubble Shoot Merge Box 2048",
    "url": "https://html5.gamemonetize.com/itojgi1jp1w75wsxdje8tv1ndlm8a0mb/",
    "thumbnail": "https://img.gamemonetize.com/itojgi1jp1w75wsxdje8tv1ndlm8a0mb/512x384.jpg",
    "genre": [
      "Shooting"
    ],
    "height": 600,
    "width": 800,
    "description": "Bubble Shoot Merge Box 2048 is a fast-paced puzzle shooter that combines classic bubble shooting mechanics with the addictive 2048 number merging gameplay. Aim, shoot, and merge identical numbered boxes to reach higher scores and unlock new levels. Designed for casual and competitive players alike, this hyper-casual arcade game challenges your logic, precision, and reflexes. With smooth gameplay, colorful graphics, and progressive difficulty, its perfect for mobile and desktop users looking for fun, brain-training action. Ideal for fans of merge games, number puzzles, and bubble shooters. Optimize your strategy and climb the leaderboard",
    "tags": [
      "2048",
      "Bubble",
      "Bubble Shooter",
      "Casual",
      "Hypercasual"
    ]
  },
  {
    "id": "34576",
    "slug": "school-stories-teacher-sim",
    "title": "School Stories: Teacher Sim",
    "url": "https://html5.gamemonetize.com/xnf3bxeet7w4y8rdmifw7hugjnyzt0ds/",
    "thumbnail": "https://img.gamemonetize.com/xnf3bxeet7w4y8rdmifw7hugjnyzt0ds/512x384.jpg",
    "genre": [
      "Adventure"
    ],
    "height": 600,
    "width": 800,
    "description": "Dive into School Stories: Teacher Sim, an addictive high school game where you become a teacher managing students and school life. Customize your teacher avatar, grade papers, and maintain discipline by catching clever cheaters using hidden phones or notes. Explore vibrant school areas like art rooms, basketball courts, and swimming pools while engaging in mini games that capture the full school experience. Perfect for fans of teacher and school simulators, this game challenges your management skills as you pass levels and unlock new activities. Whether youre enforcing rules or taking part in school life adventures, School Stories: Teacher",
    "tags": [
      "Adventure",
      "School",
      "Simulation"
    ]
  },
  {
    "id": "34575",
    "slug": "wednesday-addams-beauty-salon",
    "title": "Wednesday Addams Beauty Salon",
    "url": "https://html5.gamemonetize.com/23awz8prbs7t7jp4so5e3wlx26bvqloy/",
    "thumbnail": "https://img.gamemonetize.com/23awz8prbs7t7jp4so5e3wlx26bvqloy/512x384.jpg",
    "genre": [
      "Girls"
    ],
    "height": 600,
    "width": 800,
    "description": "Get spooky and stylish in Wednesday Addams Beauty Salon, where gothic meets glam in a 3-level makeover game. Treat Wednesday to a facial, apply stunning dark-themed makeup, and finish off with iconic dress-up fashion in her unique style. From skincare to eyeliner, you control every detail of her transformation. Whether you&amp;rsquo;re a fan of the Addams aesthetic or just love alternative beauty, this salon experience offers a complete glow-up from head to toe.",
    "tags": [
      "Cute",
      "Dress Up",
      "Fashion",
      "Girls",
      "Makeover"
    ]
  },
  {
    "id": "34574",
    "slug": "pixel-legyfare-wars",
    "title": "Pixel Legyfare Wars",
    "url": "https://html5.gamemonetize.com/ldkc6qskqhuz4baigzg3kris6ng7r6ao/",
    "thumbnail": "https://img.gamemonetize.com/ldkc6qskqhuz4baigzg3kris6ng7r6ao/512x384.jpg",
    "genre": [
      "Shooting"
    ],
    "height": 600,
    "width": 800,
    "description": "Pixel Legyfare Wars is a fast-paced, turn-based strategy game combining retro pixel graphics with modern warfare. Command your blocky armies on grid-based battlefields, using unique units and smart tactics to outmaneuver opponents. Web Dev &lt;a href='https://www.crazygamesx.com/'&gt;https://www.crazygamesx.com/&lt;/a&gt;",
    "tags": [
      "Gun",
      "legyfare",
      "Mentolatux",
      "Multiplayer",
      "Pixel",
      "Shooting",
      "unity",
      "War",
      "WebGL"
    ]
  },
  {
    "id": "31890",
    "slug": "potrick-garage-storage",
    "title": "Potrick Garage Storage",
    "url": "https://html5.gamemonetize.com/9oo46a87nxtr397y5hww6vjaxu2dpqza/",
    "thumbnail": "https://img.gamemonetize.com/9oo46a87nxtr397y5hww6vjaxu2dpqza/512x384.jpg",
    "genre": [
      "Adventure"
    ],
    "height": 600,
    "width": 800,
    "description": "Enter the chilling world of Potrick Snaps Meatly Storage, a horror game that plunges you into dark, eerie rooms brimming with jump scares and supernatural surprises. Can you survive the night and unveil the secrets of Potricks house? In this gripping mobile puzzle game, step into the shoes of a mechanic navigating a cluttered garage. Your mission: find hidden machines and unlock them with the correct 4-digit code. Use your wits to solve intricate puzzles, revealing new parts and tools to upgrade your gear, making future tasks easier. Whether you&amp;rsquo;re a seasoned puzzle master or a novice, Meatlys Storage World offers challenges for everyone.",
    "tags": [
      "3D",
      "Action",
      "Adventure",
      "Escape",
      "Horror"
    ]
  },
  {
    "id": "31828",
    "slug": "stickman-hunter",
    "title": "Stickman Hunter",
    "url": "https://html5.gamemonetize.com/vjjxb3kbxqfrdgom6d8sf2qbliboogai/",
    "thumbnail": "https://img.gamemonetize.com/vjjxb3kbxqfrdgom6d8sf2qbliboogai/512x384.jpg",
    "genre": [
      "Shooting"
    ],
    "height": 600,
    "width": 800,
    "description": "Embark on a thrilling journey in Stickman Hunter, where your mission is to protect your tribe from hidden enemies. Strategically use your ammunition to eliminate foes and rise as the tribes chieftain. With each of the 10 challenging levels, master the art of precision and cunning to uncover and defeat concealed threats. Do you have what it takes to lead your tribe to victory? How to Play: 1- Aim and shoot your weapon to hit hidden enemies. 2- Conserve ammunition and plan your shots carefully. 3- Progress through 10 increasingly difficult levels.",
    "tags": [
      "hunter",
      "Shoot",
      "Shooter",
      "Shooting",
      "Stickman"
    ]
  },
  {
    "id": "31800",
    "slug": "craft-theft-war",
    "title": "Craft Theft War",
    "url": "https://html5.gamemonetize.com/2w7rnj6q5cnt9jt81l0m7s27uqqyqq0f/",
    "thumbnail": "https://img.gamemonetize.com/2w7rnj6q5cnt9jt81l0m7s27uqqyqq0f/512x384.jpg",
    "genre": [
      "Action"
    ],
    "height": 600,
    "width": 800,
    "description": "Immerse yourself in the best open-world action-adventure sandbox game, Craft Theft War, inspired by pixel voxel cube craft style online shooting games. Enjoy a vast selection of action-packed games, cool games, and relaxing games, all within a sprawling sandbox environment. This game offers an unparalleled online gaming experience, combining the best elements of open-world adventure, sandbox gameplay, and multiplayer action. Join the fun today and discover why its one of the best online games!",
    "tags": [
      "Action",
      "Battle",
      "Bubble Shooter",
      "Multiplayer",
      "Shooting",
      "War"
    ]
  },
  {
    "id": "31748",
    "slug": "escape-wednesday",
    "title": "Escape Wednesday",
    "url": "https://html5.gamemonetize.com/5fw8d2716dxf4t9semyy8pkkfmzpz0jh/",
    "thumbnail": "https://img.gamemonetize.com/5fw8d2716dxf4t9semyy8pkkfmzpz0jh/512x384.jpg",
    "genre": [
      "Action"
    ],
    "height": 600,
    "width": 800,
    "description": "Break through the monsters to get out of the maze! Many labyrinths will not let you get bored. Show your abilities and you will be the winner. In Wednesday Escape, youll navigate through intricate mazes filled with challenging monsters. Each level presents unique obstacles that test your skills and strategy. Can you outsmart the creatures and find the exit?",
    "tags": [
      "3D",
      "Escape",
      "Monster",
      "Skill"
    ]
  },
  {
    "id": "28772",
    "slug": "garten-of-rainbow-monsters",
    "title": "Garten Of Rainbow Monsters",
    "url": "https://html5.gamemonetize.com/5mv8c9ym2sod7trmhxna4818oyf0auxb/",
    "thumbnail": "https://img.gamemonetize.com/5mv8c9ym2sod7trmhxna4818oyf0auxb/512x384.jpg",
    "genre": [
      "Action"
    ],
    "height": 600,
    "width": 800,
    "description": "Embark on an epic journey in Garten of Rainbow Monsters. Choose heroes Jack or Sara and battle fearsome foes like BanBan, Blue, Captain Fiddes, Cat, Huggy Wuggy, Jumbo Josh, and NabNab. Unleash powerful attacks, defeat monsters, and progress through stages. Reach the final stage for an ultimate showdown against a formidable boss. Save the garden from the Rainbow Monsters. The fate of the garden is in your hands!",
    "tags": [
      "Action",
      "Battle",
      "Battlegrounds",
      "Fighting",
      "Monster"
    ]
  },
  {
    "id": "28490",
    "slug": "skibidi-toilet-survival",
    "title": "Skibidi Toilet Survival",
    "url": "https://html5.gamemonetize.com/f9awds5z5fhinof9s1c17lesnwlf256a/",
    "thumbnail": "https://img.gamemonetize.com/f9awds5z5fhinof9s1c17lesnwlf256a/512x384.jpg",
    "genre": [
      "Shooting"
    ],
    "height": 600,
    "width": 800,
    "description": "Get ready for an exhilarating gaming experience with Skibidi Toilet survival! Step into the shoes of the beloved character Skibidi Toilet as you navigate through a high-stakes game inspired by the hit series Squid Game. Can you survive the intense challenges and emerge as the ultimate champion? In Skibidi Toilet survival, you will face a series of nerve-wracking tasks that will test your agility, reflexes, and nerve. The iconic green light, red light game takes center stage as you sprint, stop, and evade in a race against time. Will you listen carefully and move swiftly when the green light is on, or freeze in your tracks when the red light",
    "tags": [
      "Action",
      "Android",
      "HTML5",
      "Mobile",
      "run",
      "running",
      "Shooting",
      "Skibidi Toilet"
    ]
  },
  {
    "id": "28125",
    "slug": "war-lands-2",
    "title": "War Lands 2",
    "url": "https://html5.gamemonetize.com/oljjmrqt012pa246cjetkvm1natym9ia/",
    "thumbnail": "https://img.gamemonetize.com/oljjmrqt012pa246cjetkvm1natym9ia/512x384.jpg",
    "genre": [
      "Action"
    ],
    "height": 600,
    "width": 800,
    "description": "War Lands is a fantastic action RPG adventure. Immerse yourself in a magical world and destroy the evil creatures encroaching on the kingdom! You will face hordes of skeletons, wizards, trolls and many other enemies waiting for you in different parts of the map. Get ready for unexpected attacks from archers and carefully pass through the traps. Be sure to destroy barrels, wooden boxes and other environmental objects in order to find useful items and pump the characteristics of your character! Start playing War Lands now and enjoy great fighting animations with fantasy creatures!",
    "tags": [
      "Action",
      "Adventure",
      "Fantasy",
      "H5",
      "HTML",
      "HTML5",
      "Mobile",
      "War",
      "WebGL"
    ]
  },
  {
    "id": "28106",
    "slug": "mad-gunz-online-game",
    "title": "Mad GunZ Online Game",
    "url": "https://html5.gamemonetize.com/yyalqiiv14u7gd3c1jx14xdw6yfyqcip/",
    "thumbnail": "https://img.gamemonetize.com/yyalqiiv14u7gd3c1jx14xdw6yfyqcip/512x384.jpg",
    "genre": [
      "Action"
    ],
    "height": 600,
    "width": 800,
    "description": "Get ready for the battle royale of the century in the action-packed pixel first-person shooter Mad GunZ! Grab your gun and get ready to dive into the craziest pixel shooting games online. With simple and intuitive controls, you will become a professional in no time! Find weapons and fight off enemies. Unlock more armor and gear to stay alive for as long as possible in this multiplayer shooter. Start playing Mad GunZ now!",
    "tags": [
      "3D",
      "3D Games",
      "Action",
      "Adventure",
      "H5",
      "HTML",
      "HTML5",
      "Mobile",
      "Pixel",
      "Unity3D"
    ]
  },
  {
    "id": "19917",
    "slug": "juicy-dash",
    "title": "Juicy Dash",
    "url": "https://html5.gamemonetize.com/g81rjva025pxroexr0occf35ph427jhm/",
    "thumbnail": "https://img.gamemonetize.com/g81rjva025pxroexr0occf35ph427jhm/512x384.jpg",
    "genre": [
      "Puzzles"
    ],
    "height": 600,
    "width": 800,
    "description": "Juicy Dash - The Candy strikes back with gorgeous sweet graphics and several hundreds of brand new challenging levels and missions! In the latest entry of the famous match-three video game series it is still your task to combine at least three of the delicious sweets to make them disappear. Keep matching until you reach the goal to advance! Come back every day to try the daily challenge.",
    "tags": [
      "Boy",
      "Boys",
      "Girl",
      "Girls",
      "H5",
      "HTML5",
      "Hypercasual",
      "Match 3",
      "Match-3",
      "Match3",
      "Puzzle"
    ]
  },
  {
    "id": "19726",
    "slug": "ninja-turtles-pizza-like-a-turtle-do",
    "title": "Ninja Turtles: Pizza Like A Turtle Do!",
    "url": "https://html5.gamemonetize.com/ryjvll6g3k0bwh35en4suyuu0oqj7qa6/",
    "thumbnail": "https://img.gamemonetize.com/ryjvll6g3k0bwh35en4suyuu0oqj7qa6/512x384.jpg",
    "genre": [
      "Cooking"
    ],
    "height": 600,
    "width": 800,
    "description": "Ninja Turtles not only fight criminals and save the world or their hometown from the dangers that threaten them, in their free time they go to a pizzeria and eat pizza. You will have to become a personal cook for the turtles for a short time and feed them to satiety. You will have to cook quickly, since time is limited, if you don’t have time, you will lose your job, so good luck.",
    "tags": [
      "Boy",
      "Boys",
      "Cook",
      "Cooking",
      "Girl",
      "Girls",
      "H5",
      "Ninja",
      "Ninjago"
    ]
  },
  {
    "id": "19725",
    "slug": "collect-and-conquer",
    "title": "Collect and Conquer",
    "url": "https://html5.gamemonetize.com/ok9t2iq7uf1hg3t79fijwyjfp2ocha7p/",
    "thumbnail": "https://img.gamemonetize.com/ok9t2iq7uf1hg3t79fijwyjfp2ocha7p/512x384.jpg",
    "genre": [
      "Racing"
    ],
    "height": 600,
    "width": 800,
    "description": "Teenage Mutant Ninja Turtles: Collect &amp; Explore is a colorful adventure based on the animated series Teenage Mutant Ninja Turtles. The player is waiting for three locations where the most dangerous villains of the cartoon universe are hiding. You need to kill all the enemies, collect the mutgen and all this in a limited time, good luck.",
    "tags": [
      "Action",
      "Adventure",
      "H5",
      "Ninja",
      "Ninjago",
      "Race",
      "Racing"
    ]
  },
  {
    "id": "19041",
    "slug": "valley-gun-zombies",
    "title": "Valley Gun Zombies",
    "url": "https://html5.gamemonetize.com/60sve0i02t545g630n74hbym7zxu7hkk/",
    "thumbnail": "https://img.gamemonetize.com/60sve0i02t545g630n74hbym7zxu7hkk/512x384.jpg",
    "genre": [
      "Shooting"
    ],
    "height": 600,
    "width": 800,
    "description": "In the valley there were zombies, it's time for you to uncover a sniper rifle and begin cleaning the territory of stray ghouls. Try to take the monster on sight when it is far away. The red dot of the laser sight will help you not to miss. Do not allow the zombies to approach, you will not have time to react as he jumps up and stabs sharp teeth in the neck. Do not be deceived by the slowness of zombies, they attack instantly.",
    "tags": [
      "3D",
      "Action",
      "H5",
      "Shoot",
      "Shooter",
      "Shooting",
      "Sniper",
      "Zombie"
    ]
  },
  {
    "id": "18471",
    "slug": "skiing-fred",
    "title": "Skiing Fred",
    "url": "https://html5.gamemonetize.com/9zqzswbcmb8lo83w1wze0mmfuxjy3ztc/",
    "thumbnail": "https://img.gamemonetize.com/9zqzswbcmb8lo83w1wze0mmfuxjy3ztc/512x384.jpg",
    "genre": [
      "Racing"
    ],
    "height": 600,
    "width": 800,
    "description": "In Fred Snowboarding, the protagonist goes to the slopes to enjoy winter sports! Play Skiing Fred and earn extra points by gliding past penguins, meteors and more. Unlock new equipment to make Fred ski, and most importantly, don't let Death and the Scythe catch up with fearless Fred!",
    "tags": [
      "H5",
      "Hot",
      "HTML",
      "HTML5",
      "jump",
      "Jumping",
      "Race",
      "Racing",
      "run",
      "running",
      "subway",
      "Subway Surfers"
    ]
  },
  {
    "id": "14551",
    "slug": "puppet-master",
    "title": "Puppet Master",
    "url": "https://html5.gamemonetize.com/0var74kpvqtikopcqwlgp0vg6mjv28wu/",
    "thumbnail": "https://img.gamemonetize.com/0var74kpvqtikopcqwlgp0vg6mjv28wu/512x384.jpg",
    "genre": [
      "Clicker"
    ],
    "height": 600,
    "width": 800,
    "description": "Do you want to throw a knife, fire a machine gun or launch a rocket? Unlock weapons by damaging the ragdoll in this action-packed 3D Puppet Master Clicker game!",
    "tags": [
      "3D",
      "3D Games",
      "Action",
      "Adventure",
      "Click",
      "Clicker",
      "H5",
      "HTML",
      "HTML5"
    ]
  },
  {
    "id": "13409",
    "slug": "subway-surfers-beijing",
    "title": "Subway Surfers Beijing",
    "url": "https://html5.gamemonetize.com/dx0i6elvlqg3qfzemfo9vhf93xxsufi8/",
    "thumbnail": "https://img.gamemonetize.com/dx0i6elvlqg3qfzemfo9vhf93xxsufi8/512x384.jpg",
    "genre": [
      "Racing"
    ],
    "height": 600,
    "width": 800,
    "description": "Subway Surfers World Tour Beijing is a Html5 Games game on goolgames.com. Subway Surfers came to Beijing this time, this time he is still very naughty playing around, naturally there will be people catching him, let's also tour Beijing with him.",
    "tags": [
      "Action",
      "Adventure",
      "H5",
      "HTML",
      "HTML5",
      "Hypercasual",
      "jump",
      "Jumping",
      "Racing",
      "run",
      "running",
      "subway",
      "Subway Surfers"
    ],
    "featured": true
  },
  {
    "id": "13394",
    "slug": "the-office-guy",
    "title": "The Office Guy",
    "url": "https://html5.gamemonetize.com/o94qr2wfvmw7oqqrvxdkwodddyhybbqz/",
    "thumbnail": "https://img.gamemonetize.com/o94qr2wfvmw7oqqrvxdkwodddyhybbqz/512x384.jpg",
    "genre": [
      "Adventure"
    ],
    "height": 600,
    "width": 800,
    "description": "Office Guy is an epic fighting game about an office guy who wants to overthrow his corrupt boss. The boss has hired thugs to kill this guy, but what he doesn't know is that he's messing with the wrong person! Work your way through the office to complete tasks and fight any opponent between the guy and the boss. Let's see if you can be persistent and finally win the battle with the evil boss!",
    "tags": [
      "Action",
      "Adventure",
      "H5",
      "Hot",
      "HTML",
      "HTML5",
      "Hypercasual",
      "Puzzle"
    ]
  },
  {
    "id": "13361",
    "slug": "subway-surfers-san-francisco",
    "title": "Subway Surfers San Francisco",
    "url": "https://html5.gamemonetize.com/4i34j6xes2vdim7k55nky9w8s7wp1m75/",
    "thumbnail": "https://img.gamemonetize.com/4i34j6xes2vdim7k55nky9w8s7wp1m75/512x384.jpg",
    "genre": [
      "Racing"
    ],
    "height": 600,
    "width": 800,
    "description": "A famous and elusive street artist and bully named Jack visited the city of San Francisco today. Here our hero draws pictures on the walls of the building with the help of paint cans in various places. As always, the police are tracking him. In the game Subway Surfers: San Francisco you will help the guy hide from their pursuit. In front of you on the screen you will see your character, who with all his might, gradually gaining speed, will run along the road. Policemen will follow on his heels. Look at the screen carefully. On the way of our hero, obstacles will await. You deftly controlling his actions will have to run around them all or jump over. There will also be coins and other items on the road that you will need to pick up on the run. They will bring you points, and they can also reward the character with temporary bonus",
    "tags": [
      "Action",
      "Adventure",
      "H5",
      "Hot",
      "HTML",
      "HTML5",
      "jump",
      "Jumping",
      "Racing",
      "run",
      "running",
      "subway",
      "Subway Surfers",
      "Unity3D"
    ]
  },
  {
    "id": "13360",
    "slug": "subway-surfers-london-2021",
    "title": "Subway Surfers London 2021",
    "url": "https://html5.gamemonetize.com/pgdxxxm8p9szy0rrl8bb1uw7z9gpkr6a/",
    "thumbnail": "https://img.gamemonetize.com/pgdxxxm8p9szy0rrl8bb1uw7z9gpkr6a/512x384.jpg",
    "genre": [
      "Racing"
    ],
    "height": 600,
    "width": 800,
    "description": "Snowy London is waiting for you! Head down to the city subway and start playing Subway Surfers New Years London! Run as far as you can in this endless runner, collect coins, dodge obstacles, trains and don't let the grumpy inspector in a Santa suit get you. Good luck!",
    "tags": [
      "Action",
      "Adventure",
      "H5",
      "Hot",
      "HTML",
      "HTML5",
      "Hypercasual",
      "jump",
      "Jumping",
      "Racing",
      "run",
      "running",
      "subway",
      "Subway Surfers"
    ]
  },
  {
    "id": "13321",
    "slug": "subway-surfers-zurich",
    "title": "Subway Surfers Zurich",
    "url": "https://html5.gamemonetize.com/lhpdj67fzrlgqcaelzd4yqdzyvsgvi7h/",
    "thumbnail": "https://img.gamemonetize.com/lhpdj67fzrlgqcaelzd4yqdzyvsgvi7h/512x384.jpg",
    "genre": [
      "Racing"
    ],
    "height": 600,
    "width": 800,
    "description": "Subway Surfers World Tour: Zurich 2020 is the one hundred twenty-first update of Subway Surfers and the one hundred fifteenth ​​​​​installment in the World Tour series. This edition includes the return of Hugo as a prize of the Season Hunt, with a new outfit called Pirate Outfit for 30 Key.png. This edition also has the return of Clockwork as a prize of the Season Hunt.",
    "tags": [
      "Action",
      "Adventure",
      "H5",
      "Hot",
      "HTML",
      "HTML5",
      "Hypercasual",
      "jump",
      "Jumping",
      "Racing",
      "run",
      "running",
      "subway",
      "Subway Surfers"
    ]
  },
  {
    "id": "13286",
    "slug": "subway-surfers-new-orleans",
    "title": "Subway Surfers New Orleans",
    "url": "https://html5.gamemonetize.com/d6ejmocd0ypbji3v95mo2nrx684shrnu/",
    "thumbnail": "https://img.gamemonetize.com/d6ejmocd0ypbji3v95mo2nrx684shrnu/512x384.jpg",
    "genre": [
      "Hypercasual"
    ],
    "height": 600,
    "width": 800,
    "description": "Welcome to New Orleans! Ready to take a city subway journey and enjoy the beauty of the city ahead of Halloween? Run as far as you can in this endless runner, collect coins, dodge obstacles, trains and don't let the grumpy inspector grab you. Good luck!",
    "tags": [
      "3D",
      "3D Games",
      "Action",
      "Adventure",
      "H5",
      "HTML",
      "HTML5",
      "Hypercasual",
      "jump",
      "Jumping",
      "run",
      "running",
      "Submachine",
      "subway",
      "Subway Surfers",
      "Unity3D"
    ],
    "featured": true
  },
  {
    "id": "13285",
    "slug": "subway-surfers-saint-petersburg",
    "title": "Subway Surfers Saint Petersburg",
    "url": "https://html5.gamemonetize.com/dkbsawti14y62zfk4khg33xgk12guaf7/",
    "thumbnail": "https://img.gamemonetize.com/dkbsawti14y62zfk4khg33xgk12guaf7/512x384.jpg",
    "genre": [
      "Hypercasual"
    ],
    "height": 600,
    "width": 800,
    "description": "Ready for a new adventure in Subway Surf St. Petersburg? Get down into the subway and don't let the grumpy inspector grab you. Good luck!",
    "tags": [
      "3D",
      "3D Games",
      "Action",
      "Adventure",
      "H5",
      "HTML",
      "HTML5",
      "Hypercasual",
      "jump",
      "Jumping",
      "run",
      "running",
      "subway",
      "Subway Surfers",
      "Unity3D"
    ]
  },
  {
    "id": "28037",
    "slug": "save-the-masters",
    "title": "Save the Masters",
    "url": "https://html5.gamemonetize.com/6ccuk6fosd4jzx9h096uyzmfyea1dq5x/",
    "thumbnail": "https://img.gamemonetize.com/6ccuk6fosd4jzx9h096uyzmfyea1dq5x/512x384.jpg",
    "genre": [
      "Clicker"
    ],
    "height": 600,
    "width": 800,
    "description": "Chase the highest scores in a fun puzzle strategy action, that is based solely on your skill and logic! Aim carefully to rescue a wide variety of characters from a certain doom. Take your shot to cut down the rope - just aim and swipe in the right direction! What are you waiting for? Get out and save as many characters as possible! The game will be exciting for both kids and adults.",
    "tags": [
      ".io",
      ".io Games",
      "Game",
      "Games",
      "HTML5"
    ]
  },
  {
    "id": "28036",
    "slug": "rumble-stars-football-online-soccer-game",
    "title": "Rumble Stars Football  - Online Soccer Game",
    "url": "https://html5.gamemonetize.com/654piwop8aishca8qzpbdb7t8gp5msdv/",
    "thumbnail": "https://img.gamemonetize.com/654piwop8aishca8qzpbdb7t8gp5msdv/512x384.jpg",
    "genre": [
      "Multiplayer"
    ],
    "height": 600,
    "width": 800,
    "description": "Explosive multiplayer soccer game with crazy action, easy to pick up! Assemble your Rumble Stars team and advance through the leagues in this real-time multiplayer soccer game! Launch your Rumblers onto the field, synchronize your timing and create strategic combos to challenge your opponents and score goals! Then upgrade your team and climb the world rankings.",
    "tags": [
      "2 Player Games",
      "Football",
      "Multiplayer",
      "Music"
    ]
  },
  {
    "id": "28035",
    "slug": "bubble-shooter-puzzle-games",
    "title": "Bubble Shooter - Puzzle games",
    "url": "https://html5.gamemonetize.com/q7v7muxh7cvjlzi9hbmj5oixkzxmqxr0/",
    "thumbnail": "https://img.gamemonetize.com/q7v7muxh7cvjlzi9hbmj5oixkzxmqxr0/512x384.jpg",
    "genre": [
      "Hypercasual"
    ],
    "height": 600,
    "width": 800,
    "description": "Bubble Shooter is the #1 addictive bubble shooting puzzle game on Android. Aim, fire and pop your way through this enchanting bubble shooter adventure today! Shoot and match 3 or more bubbles in this tasty game for sweet winning feeling! Pop and burst with quick thinking and smart tactics to progress to the next challenging level and be awarded with powerful boosters. Are you ready to pop and blast now?",
    "tags": [
      "Bubble",
      "Bubble Shooter",
      "Game",
      "Games"
    ]
  },
  {
    "id": "28034",
    "slug": "free-rider-hd",
    "title": "Free Rider HD",
    "url": "https://html5.gamemonetize.com/r4n3fj7vabu6r7lq074lbmv08dwxzn5s/",
    "thumbnail": "https://img.gamemonetize.com/r4n3fj7vabu6r7lq074lbmv08dwxzn5s/512x384.jpg",
    "genre": [
      "Fighting"
    ],
    "height": 600,
    "width": 800,
    "description": "The OFFICIAL hit web game with over ONE BILLION PLAYS and MILLIONS OF TRACKS is coming to Android! Race bikes on tracks designed by other players! Collect all the stars to complete a track. ALL tracks have been drawn by players. Come across a track you don't like? Skip it and make your way! This game has INFINITE CONTENT!",
    "tags": [
      "Adventure",
      "Games",
      "Stickman"
    ]
  },
  {
    "id": "28033",
    "slug": "real-motocross",
    "title": "Real Motocross",
    "url": "https://html5.gamemonetize.com/awmd9oe0fvtfbuf50vtz6k451t4agzcv/",
    "thumbnail": "https://img.gamemonetize.com/awmd9oe0fvtfbuf50vtz6k451t4agzcv/512x384.jpg",
    "genre": [
      "Sports"
    ],
    "height": 600,
    "width": 800,
    "description": "Get ready for an amazing gaming experience with the most realistic moto cross game on Android! Race with the AI in single player mode or online with your friends in multiplayer mode! Repair your bike and upgrade parts to win on increasingly difficult tracks!",
    "tags": [
      "Game",
      "Games",
      "Moto",
      "Motorcycle"
    ]
  },
  {
    "id": "28032",
    "slug": "air-hockey-classic",
    "title": "Air Hockey - Classic",
    "url": "https://html5.gamemonetize.com/0md3gt8ahk982d7xdoeqx6dn2dxkbr0k/",
    "thumbnail": "https://img.gamemonetize.com/0md3gt8ahk982d7xdoeqx6dn2dxkbr0k/512x384.jpg",
    "genre": [
      "Shooting"
    ],
    "height": 600,
    "width": 800,
    "description": "You can now play the classic Air Hockey arcade game on your phone or tablet! The objective of the game is to get the puck in the goal of your opponent. But watch out, the other player will try and score as well! The first player to reach 7 goals wins the match.",
    "tags": [
      "Air",
      "Game",
      "Games",
      "Shooter",
      "Shooting"
    ]
  },
  {
    "id": "28031",
    "slug": "rumble-stars-football",
    "title": "Rumble Stars Football",
    "url": "https://html5.gamemonetize.com/cy67u9altfod8zcvn79a02e6mjvjhui6/",
    "thumbnail": "https://img.gamemonetize.com/cy67u9altfod8zcvn79a02e6mjvjhui6/512x384.jpg",
    "genre": [
      "Soccer"
    ],
    "height": 600,
    "width": 800,
    "description": "Explosive multiplayer soccer game with crazy action, easy to pick up! Assemble your Rumble Stars team and progress through the leagues in this real-time multiplayer soccer game!",
    "tags": [
      "2 Player Games",
      "Football",
      "Game",
      "Games",
      "Soccer"
    ]
  },
  {
    "id": "28030",
    "slug": "filles-habillage-et-maquillage",
    "title": "Filles Habillage et Maquillage",
    "url": "https://html5.gamemonetize.com/2jdgrkgo3i9sxjtwuam2gnoh3vfqqn5p/",
    "thumbnail": "https://img.gamemonetize.com/2jdgrkgo3i9sxjtwuam2gnoh3vfqqn5p/512x384.jpg",
    "genre": [
      "Girls"
    ],
    "height": 600,
    "width": 800,
    "description": "Hey fashion stylist girls! Your passion as a stylist brings you to a world full of beauty and glamour. It's time to become a fashion guru and love your style princess dress up game. It's time for all our dress designers and stylists to show their super style expertise on the dress. Create a fabulous look with trendy hairstyle and outstanding outfit for girls fashion game contest. Style your supermodel as a fashion stylist in the beauty and spa makeup game and hair salon with a haircut and dressing battle.",
    "tags": [
      "Game",
      "Games",
      "Girl",
      "Girls"
    ]
  },
  {
    "id": "28029",
    "slug": "bubble-shooter-pop-fun-blast",
    "title": "Bubble Shooter Pop: Fun Blast",
    "url": "https://html5.gamemonetize.com/znee39i0au1lz0430t0ewsfn2vz807ra/",
    "thumbnail": "https://img.gamemonetize.com/znee39i0au1lz0430t0ewsfn2vz807ra/512x384.jpg",
    "genre": [
      "Arcade"
    ],
    "height": 600,
    "width": 800,
    "description": "Shoot and pop bubbles and experience hours of fun in this classic bubble shooter game! Bubble Shooter 3 is a new and awesome bubble game, perfect for friends and family to play and enjoy. Play now and experience endless excitement with this highly addictive game!",
    "tags": [
      "Arcade",
      "Bubble",
      "Bubble Shooter"
    ]
  },
  {
    "id": "28028",
    "slug": "beauty-makeover-games-salon-s",
    "title": "Beauty Makeover Games: Salon S",
    "url": "https://html5.gamemonetize.com/x65i62kaz68w2jm20rix9vilt9p9rgmu/",
    "thumbnail": "https://img.gamemonetize.com/x65i62kaz68w2jm20rix9vilt9p9rgmu/512x384.jpg",
    "genre": [
      "Girls"
    ],
    "height": 600,
    "width": 800,
    "description": "Hey girls! Come and enjoy running your Beauty Clinic now! There are so many clients who wait for a new SPA experience! There, Beauty Clinic, your goal is to make your customers look amazing and feel satisfied.",
    "tags": [
      "Game",
      "Games",
      "Girl",
      "Girls",
      "Makeover"
    ]
  },
  {
    "id": "24276",
    "slug": "trials-frontier",
    "title": "Trials Frontier",
    "url": "https://html5.gamemonetize.com/76zrt3sjnq3g82c3kd2h6yp8tnt7qx64/",
    "thumbnail": "https://img.gamemonetize.com/76zrt3sjnq3g82c3kd2h6yp8tnt7qx64/512x384.jpg",
    "genre": [
      "Sports"
    ],
    "height": 600,
    "width": 800,
    "description": "Play the mobile version of the best game in the critically acclaimed Trials series from award-winning publisher RedLynx! Experience the ultimate motorcycle game for smartphones and tablets for free!",
    "tags": [
      "Game",
      "Games",
      "Moto",
      "Motorcycle"
    ]
  },
  {
    "id": "20870",
    "slug": "block-puzzle-guardian-puzzle",
    "title": "Block Puzzle Guardian - Puzzle",
    "url": "https://html5.gamemonetize.com/i3zdjzov7usdt7axcis4fc9og2sr2lr5/",
    "thumbnail": "https://img.gamemonetize.com/i3zdjzov7usdt7axcis4fc9og2sr2lr5/512x384.jpg",
    "genre": [
      "Puzzles"
    ],
    "height": 600,
    "width": 800,
    "description": "Block Puzzle Jewel Game ★ Enjoy the classic jewel style block puzzle game!",
    "tags": [
      "3D Games",
      "Block",
      "Games",
      "Puzzle"
    ]
  },
  {
    "id": "20824",
    "slug": "mandala-coloring-book-casual",
    "title": "Mandala Coloring Book - Casual",
    "url": "https://html5.gamemonetize.com/hb2ngrh7okkt8qcu0napz776q2juzq8w/",
    "thumbnail": "https://img.gamemonetize.com/hb2ngrh7okkt8qcu0napz776q2juzq8w/512x384.jpg",
    "genre": [
      "Hypercasual"
    ],
    "height": 600,
    "width": 800,
    "description": "Mandala Coloring Book is an excellent coloring application, imitating real coloring experience With rich patterns, including Mandala Alphabet，Mandala Art，Mandala Flowers，Primary Mandala，Senior Mandala etc.",
    "tags": [
      "Color",
      "Coloring",
      "Game",
      "Games",
      "Hypercasual"
    ]
  },
  {
    "id": "20800",
    "slug": "basketball-cerceaux-de-tir",
    "title": "Basketball: Cerceaux de tir",
    "url": "https://html5.gamemonetize.com/xgr7zswd1kenpgsajhpha7z5opy2icis/",
    "thumbnail": "https://img.gamemonetize.com/xgr7zswd1kenpgsajhpha7z5opy2icis/512x384.jpg",
    "genre": [
      "Sports"
    ],
    "height": 600,
    "width": 800,
    "description": "Basketball is a super fun basketball game! Find out if your basketball skills can score baskets and complete all the levels. Some of the baskets to score are completely insane, so the multiple obstacles won't be easy!",
    "tags": [
      "Baseball",
      "Basketball",
      "Game",
      "Games",
      "Sport",
      "Sports"
    ]
  },
  {
    "id": "20792",
    "slug": "bus-rush-subway",
    "title": "Bus Rush - subway",
    "url": "https://html5.gamemonetize.com/6bqaio3krcnrdf89f7n8uqrwdu203q5l/",
    "thumbnail": "https://img.gamemonetize.com/6bqaio3krcnrdf89f7n8uqrwdu203q5l/512x384.jpg",
    "genre": [
      "Adventure"
    ],
    "height": 600,
    "width": 800,
    "description": "Bus Rush is an amazing racing game for Android. Drive on amazing tracks in Bus Rush City. Touch the screen to jump or slide and move left or right. Avoid hitting trucks, buses and trains. Travel through the cities, forests and beaches of Bus Rush and collect as many coins as possible.",
    "tags": [
      "Action",
      "Adventure",
      "Game",
      "Games",
      "subway",
      "Subway Surfers"
    ]
  },
  {
    "id": "20278",
    "slug": "tennis-world-open-2022-sport",
    "title": "Tennis World Open 2022 - Sport",
    "url": "https://html5.gamemonetize.com/p27dmexehw6q60qju1ldo8d9pt4fem4d/",
    "thumbnail": "https://img.gamemonetize.com/p27dmexehw6q60qju1ldo8d9pt4fem4d/512x384.jpg",
    "genre": [
      "Sports"
    ],
    "height": 600,
    "width": 800,
    "description": "Experience tennis game in 3D! Here your knowledge of tenis is a valuable asset. You will have a chance to get better in your tenis skills, playstyles, and moves where we paid attention to every detail so we can be better than any other tennis game. Also, you can enjoy the real pleasure from free tennis games.",
    "tags": [
      "2 Player Games",
      "Sport",
      "Sports"
    ]
  },
  {
    "id": "18876",
    "slug": "world-champions-football-sim",
    "title": "World Champions Football Sim",
    "url": "https://html5.gamemonetize.com/w3bs36qirivk7hps6ousgo7dno17lrvw/",
    "thumbnail": "https://img.gamemonetize.com/w3bs36qirivk7hps6ousgo7dno17lrvw/512x384.jpg",
    "genre": [
      "Sports"
    ],
    "height": 600,
    "width": 800,
    "description": "Super goal soccer has arrived! Prepare to take on challenges from Mexican super soccer from around the world. World ultimate league soccer is the most innovative, intriguing, and intense football game. Play soccer 3d Evo elite with real teams customized league matches and improve your soccer skill.",
    "tags": [
      "2 Player",
      "2 Player Games",
      "Football",
      "Games"
    ]
  },
  {
    "id": "18757",
    "slug": "baldi-fnf-music-mod",
    "title": "Baldi FNF Music Mod",
    "url": "https://html5.gamemonetize.com/bywzebj93d9w2c7r70pfya0n5c92d353/",
    "thumbnail": "https://img.gamemonetize.com/bywzebj93d9w2c7r70pfya0n5c92d353/512x384.jpg",
    "genre": [
      "Soccer"
    ],
    "height": 600,
    "width": 800,
    "description": "Today is Friday. And, you do love horror things in school at night. Welcome you! This horror fantastic game will fulfill your dream with funkin music battles.",
    "tags": [
      "Game",
      "Games",
      "Mobile",
      "Music"
    ]
  },
  {
    "id": "18755",
    "slug": "rider-adventure",
    "title": "Rider - adventure",
    "url": "https://html5.gamemonetize.com/udfcfx1oiyzey5y25jouyj4wjgfk08v7/",
    "thumbnail": "https://img.gamemonetize.com/udfcfx1oiyzey5y25jouyj4wjgfk08v7/512x384.jpg",
    "genre": [
      "Arcade"
    ],
    "height": 600,
    "width": 800,
    "description": "Perform insane stunts while you cruise through the never-ending world of Rider! Grab your motorcycle and start flipping like a maniac!",
    "tags": [
      "Adventure",
      "Arcade",
      "Game",
      "Games"
    ]
  },
  {
    "id": "18753",
    "slug": "motocross-dirt-bike-racing",
    "title": "Motocross Dirt Bike Racing",
    "url": "https://html5.gamemonetize.com/z9jn7tsxst2ptndvrm2t9ya74sgug443/",
    "thumbnail": "https://img.gamemonetize.com/z9jn7tsxst2ptndvrm2t9ya74sgug443/512x384.jpg",
    "genre": [
      "Racing"
    ],
    "height": 600,
    "width": 800,
    "description": "Moto Bike Stunt Master is all about bike balance, skill and control as you take your rider across the ramps, jumps, barrels and obstacles perform daring stunts in the arena of race games. We give you all Dirt Bike Extreme Racing Tricky Stunts Master pit moto games where you can not only ride on bike but perform extreme bike stunts like a pro super bike stunts speed bike racer",
    "tags": [
      "Game",
      "Games",
      "Moto",
      "Motorcycle",
      "Race",
      "Racing"
    ]
  },
  {
    "id": "18695",
    "slug": "tireur-isole-modern-sniper",
    "title": "Tireur isolé - Modern Sniper",
    "url": "https://html5.gamemonetize.com/8n5ahpuxtiiunppfsesj3ywkzcxhkqtf/",
    "thumbnail": "https://img.gamemonetize.com/8n5ahpuxtiiunppfsesj3ywkzcxhkqtf/512x384.jpg",
    "genre": [
      "Shooting"
    ],
    "height": 600,
    "width": 800,
    "description": "The best sniper has to face shootings and assassination, you walk on the margins of society. Sometimes you have to sweep the whole street with the weapon, sometimes you will kill the target only. The sniper rifle will be your best tool, show your ability and accept the missions with your confidence.",
    "tags": [
      "Game",
      "Games",
      "Shoot",
      "Shooting"
    ]
  },
  {
    "id": "ps-7870616a94add6a85117dff74f0a42ba",
    "slug": "mrmine-idle",
    "title": "Mr.Mine Idle",
    "url": "https://mrmine.com/game/",
    "thumbnail": "https://cdn.playsaurus.com/embed/7870616a94add6a85117dff74f0a42ba-512x512.jpeg",
    "genre": [
      "Idle",
      "Clicker",
      "Incremental"
    ],
    "mobile": false,
    "height": 720,
    "width": 1280,
    "description": "Explore the depths of the earth and uncover hidden treasures in this addictive idle mining game. Unlock the power of your drill with hundreds of upgrades, discover mysterious relics, and unearth priceless gems. Can you master the mines and reveal their deepest secrets? Dive in and dig deep!",
    "tags": [
      "Clicker",
      "Simulation",
      "Mining",
      "Building",
      "Incremental",
      "Management",
      "Crafting",
      "Upgrade",
      "HTML5",
      "Idle",
      "Collect",
      "Idler"
    ]
  },
  {
    "id": "ps-032c979bf9188f910239447f43617697",
    "slug": "clicker-heroes",
    "title": "Clicker Heroes",
    "url": "https://cdn.clickerheroes.com/gamebuild/index.php",
    "thumbnail": "https://cdn.playsaurus.com/embed/032c979bf9188f910239447f43617697-512x512.jpeg",
    "genre": [
      "Idle",
      "Clicker",
      "Incremental"
    ],
    "mobile": false,
    "height": 720,
    "width": 1280,
    "description": "Ever wondered what one quadrillion damage per second feels like in an incremental clicker game? Wonder no more! Embark on your quest to attain it today in Clicker Heroes, the ultimate idle RPG game!",
    "tags": [
      "Clicker",
      "Simulation",
      "RPG",
      "Heroes",
      "Incremental",
      "Management",
      "Upgrade",
      "Idler",
      "Idle",
      "Upgrades"
    ]
  },
  {
    "id": "ps-1f50dfc26741aa81630f16b78b68c54a",
    "slug": "poker-quest",
    "title": "Poker Quest",
    "url": "https://playsaurus.com/kongPokerQuest63/",
    "thumbnail": "https://cdn.playsaurus.com/embed/1f50dfc26741aa81630f16b78b68c54a-512x512.jpeg",
    "genre": [
      "Adventure",
      "Puzzle",
      "Action"
    ],
    "mobile": false,
    "height": 720,
    "width": 1280,
    "description": "Poker Quest is a fantasy roguelike where players use a standard 52-card deck to take on fierce enemies in epic battles. Featuring over 20 unique heroes, thousands of items, and deep gameplay that will test even the most experienced players.",
    "tags": [
      "Adventure",
      "Battle",
      "Roguelike",
      "Card",
      "Monster",
      "Rpg",
      "Skill",
      "Fantasy",
      "Upgrade",
      "HTML5"
    ]
  },
  {
    "id": "ps-f2e16411172107085a070007e2bd0480",
    "slug": "grindcraft",
    "title": "Grindcraft",
    "url": "https://grindcraft.com/game.php",
    "thumbnail": "https://cdn.playsaurus.com/embed/f2e16411172107085a070007e2bd0480-512x512.jpeg",
    "genre": [
      "Adventure",
      "Idle",
      "Clicker"
    ],
    "mobile": true,
    "height": 720,
    "width": 1280,
    "description": "Grindcraft is a free Minecraft inspired idle clicker game! Grind out items, gather crops, mine resources and fight mobs in the original crafting clicker game. Build items and adventure to new regions. Become a clicker legend!",
    "tags": [
      "Clicker",
      "Sandbox",
      "Pixel",
      "Minecraft",
      "Crafting",
      "HTML5",
      "Idle"
    ]
  },
  {
    "id": "ps-3dfd7ce434f0b2ffdbc29c9b7f3e4cd2",
    "slug": "fray-fight",
    "title": "Fray Fight",
    "url": "https://frayfight.com/game/",
    "thumbnail": "https://cdn.playsaurus.com/embed/3dfd7ce434f0b2ffdbc29c9b7f3e4cd2-512x512.jpeg",
    "genre": [
      "Adventure",
      "Arcade",
      "Action"
    ],
    "mobile": false,
    "height": 720,
    "width": 1280,
    "description": "All roads end in Valhalla, but the legacy you build before reaching your doom is up to you. Pick your character and choose your build carefully while you survive waves of enemies and attempt to make it where no one has before.",
    "tags": [
      "Action",
      "WebGL",
      "Combat",
      "Monster",
      "RPG",
      "Weapon",
      "Survival",
      "Collect",
      "Upgrade",
      "Killing"
    ]
  },
  {
    "id": "ps-08a91f5aba7aa8b61007f1d731502cc8",
    "slug": "race-clicker-idle",
    "title": "Race Clicker Idle",
    "url": "https://cdn.raceclickergame.com/",
    "thumbnail": "https://cdn.playsaurus.com/embed/08a91f5aba7aa8b61007f1d731502cc8-512x512.jpeg",
    "genre": [
      "Incremental",
      "Clicker",
      "Racing"
    ],
    "mobile": false,
    "height": 720,
    "width": 1280,
    "description": "Rev up in this idle racer game. Upgrade and speed to the top. Every click increases speed, every upgrade expands boundaries. Outrun rivals in continuous action!",
    "tags": [
      "Action",
      "WebGL",
      "Idle",
      "Racing",
      "Incremental",
      "Management",
      "Upgrade"
    ]
  },
  {
    "id": "ps-328f10992805910cdb4123bd844f5427",
    "slug": "creature-card-idle",
    "title": "Creature Card Idle",
    "url": "https://cdn.creaturecardidle.com/game-build/index.html",
    "thumbnail": "https://cdn.playsaurus.com/embed/328f10992805910cdb4123bd844f5427-512x512.jpeg",
    "genre": [
      "Incremental",
      "Clicker",
      "Idle"
    ],
    "mobile": false,
    "height": 720,
    "width": 1280,
    "description": "Creature Card Idle is an incremental game that fuses strategic grid-based gameplay with the thrill of collecting cards. Experience an evolving journey across expansions, each introducing new mechanics and cards.",
    "tags": [
      "Action",
      "WebGL",
      "Idle",
      "Fantasy",
      "Incremental",
      "Management",
      "Upgrade",
      "Monster",
      "Card"
    ],
    "featured": true
  }
]
